[
  {
    "Name": "CÔNG TY CỔ PHẦN AHT TECH",
    "ApplicationDeadline": "27/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/java-backend-developer-banking-project-offer-upto-30m/1517182.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Viết tài liệu thiết kế chi tiết, thiết kế CSDL\nThiết kế được các module thành phần, các chức năng chi tiết theo kiến trúc đã có sẵn\nTích hợp mã nguồn (merge code), tích hợp hệ thống\nThực hiện các nhiệm vụ sửa lỗi được phát hiện trong quá trình phát triển và triển khai\nLập trình các chức năng được giao theo tài liệu giải pháp chi tiết\nViết tài liệu Hướng dẫn cài đặt, vận hành, khai thác\nThực hiện upcode các yêu cầu nâng cấp của dự án\nViết và thực hiện unit test\nThực hiện các công việc khác theo yêu cầu của Manager",
    "JobId": "21f08ee6-5892-4961-99f3-2bfd90a99434",
    "Requirements": "Ít nhất 2 năm kinh nghiệm với Java và Spring Boot\nKinh nghiệm thiết kế hệ thống back-end cho các dự án ngân hàng, đạt trình độ middle trở lên\nCó kinh nghiệm làm việc với Angular là một lợi thế\nCó kinh nghiệm lập trình webservice, microservice và tích hợp cơ sở dữ liệu\nKinh nghiệm làm việc với cơ sở dữ liệu Oracle và các cơ sở dữ liệu quan hệ khác. Ưu tiên nếu có kinh nghiệm với cơ sở dữ liệu NoSQL\nKinh nghiệm lập trình với Spring JPA, Spring Kafka, Spring Cloud OpenFeign, Redis, và sử dụng Jasper Report\nHiểu biết sâu về Java Core (Collections, Generics, Lambda, Stream API, v.v.)\nThành thạo Spring Framework (IoC Container, Bean lifecycle, AOP, v.v.) và Spring Boot\nKinh nghiệm xây dựng ứng dụng web với Spring MVC, Spring Data, Spring Security\nKinh nghiệm viết kiểm thử đơn vị với JUnit và Mockito\nSử dụng thành thạo các công cụ quản lý mã nguồn như Git hoặc SVN\nKinh nghiệm sử dụng các công cụ giám sát, đo lường và quản lý ứng dụng Spring Boot\nCó khả năng lập trình và tích hợp các chức năng của hệ thống theo phân công",
    "Benefits": "Bạn sẽ được:\nMức lương theo năng lực\nReview lương theo lộ trình của công ty\nThưởng hiệu quả theo hiệu suất làm việc của quý - năm dựa theo kết quả hoạt động kinh doanh công ty\nĐược tư vấn, định hướng về career-path rõ ràng\nTham gia các chương trình đào tạo nội bộ nâng cao năng lực tại công ty\nCó cơ hội tham gia lớp học tiếng Anh/ tiếng Nhật do công ty tổ chức\nMôi trường làm việc cởi mở, trẻ trung, thân thiện, nhiều cơ hội thăng tiến trong công việc, cùng học hỏi với đồng nghiệp trẻ trung thân thiện\nThời gian làm việc: Thứ 2 - Thứ 6: 8h - 17h. Nghỉ trưa 12h-13h. (Tuỳ từng bank sẽ có lịch làm việc vào 2-3 thứ 7/tháng - trao đổi thêm)\nCùng với chế độ:\nHưởng đầy đủ các chế độ BHXH, BHYT, BHTN cho CBNV theo quy định của Pháp luật\nNhiều hoạt động được tổ chức trong năm: New Year Party, Company trip,...\nTham gia nhiều hoạt động tập thể sáng tạo, hoạt động thiện nguyện, các giải phong trào nội bộ,..\nCó cơ hội training nội bộ nâng cao kỹ năng chuyên môn và kỹ năng mềm\nKhám sức khỏe định kỳ 1 lần/ năm tại các bệnh viện quốc tế\n12 ngày nghỉ phép nguyên lương/ năm và 1 ngày nghỉ phép trong tháng sinh nhật\nCó cơ hội thi các chứng chỉ quốc tế do công ty tài trợ",
    "Address": "- Hà Nội: Trần Quang Khải, Hoàn Kiếm\n- Hà Nội: Lê Ngọc Hân, Hai Bà Trưng",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY TNHH HAPOSOFT",
    "ApplicationDeadline": "31/12/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/fullstack-dev-tieng-anh-tu-2-7-nam-kinh-nghiem/1525662.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Tham gia phát triển các dự án Web của khách hàng.\nTham gia phân tích yêu cầu, thiết kế hệ thống, thiết kế Database, phát triển các chức năng.\nThực hiện công việc theo mô hình Agile/ Scrum, lập kế hoạch, thực hiện, kiểm soát và báo cáo công việc theo từng Sprint.\nHỗ trợ đào tạo, chia sẻ kiến thức, review code cho các thành viên trong team.\nTham gia build team, quản lý team (nếu đã có kinh nghiệm).\nNghiên cứu và định hướng các công nghệ mới áp dụng vào dự án.",
    "JobId": "356b23ad-d038-43df-a2ad-0a7d6efb43f1",
    "Requirements": "Tốt nghiệp CĐ/ĐH chuyên ngành CNTT hoặc có liên quan.\nÍt nhất từ 1 năm kinh nghiệm làm việc Web Development với Backend: NodeJS (Express, NestJS) hoặc Web Framework tương đương (PHP Laravel, Rails, ...)\nÍt nhất 1 năm kinh nghiệm làm việc với Frontend Framework: React/NextJS hoặc Vue/NuxtJS\nCó kiến thức về phát triển hệ thống Web tốt (HTML/CSS/Javascript,...), có khả năng xây dựng trang web responsive.\nCó kiến thức về OOP, Coding Convention, Architecture Patterns (MVC, MVP, MVVM).\nHiểu biết về Restful API, Design Pattern,...\nCó kinh nghiệm thiết kế và xây dựng cơ sở dữ liệu với RDBMS (MySQL, PostgreSQL) hoặc NoSQL(MongoDB, DynamoDB,...)\nCó khả năng tư duy, học hỏi nhanh; chủ động trong công việc; làm việc độc lập và làm việc nhóm tốt.\nTiếng Anh giao tiếp tốt, có thể trao đổi với khách hàng.\nLợi thế(không bắt buộc): \nƯu tiên ứng viên đã làm trong các dự án theo mô hình Agile/ Scrum.\nCó kinh nghiệm team leader là lợi thế.\nCó các chứng chỉ ngoại ngữ/ chuyên môn như IELTS, JLPT, AWS, PSM,... là lợi thế.",
    "Benefits": "Mức lương thỏa thuận theo kinh nghiệm \nThưởng cuối năm theo hiệu suất làm việc và tình hình kinh doanh của công ty.\nThưởng hoặc quà tặng các dịp lễ, sinh nhật.\nReview tăng lương 2 lần/ năm.\nHỗ trợ 100% học phí và lệ phí thi các chứng chỉ chuyên môn.\nĐóng bảo hiểm và các chế độ khác đầy đủ theo quy định của Luật (ngày nghỉ phép, lương OT...).\nCơ hội thăng tiến cao trở thành Team Leader, Techlead, PM.\nĐược hỗ trợ nâng cao kiến thức, kỹ năng thông qua các hoạt động: Seminar; CLB chuyên môn; Các khóa đào tạo từ học viện uy tín,...\nHỗ trợ định hướng lộ trình phát triển bản thân, định hướng mục tiêu cá nhân (OKR, 1on1 với mentor nhiều kinh nghiệm).\nLuôn tạo môi trường làm việc IT thoải mái, năng động và đặc biệt hỗ trợ nhau trong công việc.\nTham gia các hoạt động tập thể của công ty: Team building, du lịch, CLB bóng đá, happy hour hàng tháng...\nCung cấp đầy đủ thiết bị làm việc; Free trà, cafe,...",
    "Address": "- Hà Nội: Mitec Tower, Dương Đình Nghệ, Yên Hòa, Cầu Giấy",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:30 đến 17:30)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "Công ty TNHH VKX",
    "ApplicationDeadline": "29/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/truong-nhom-lap-trinh-developer-leader-yeu-cau-4-nam-kinh-nghiem-thu-nhap-len-toi-45-trieu-thang-lam-viec-tai-ha-noi/1518802.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "- Quản lý đội ngũ phát triển phần mềm: Lãnh đạo và hướng dẫn các lập trình viên trong nhóm, đảm bảo tiến độ và chất lượng công việc. \n- Thiết kế và phát triển phần mềm: Tham gia nghiên cứu, phát triển, nâng cấp các sản phẩm phần mềm Geosis, số hóa dịch vụ công, ... với vai trò Team Leader\n- Thiết kế kiến trúc hệ thống, Database, phát triển các chức năng đồng thời support các thành viên trong team\n- Làm các công việc khác theo sự phân công của quản lý.",
    "JobId": "8b0fb8a5-ed6d-4abe-94c6-9deb51328ff0",
    "Requirements": "- Có kinh nghiệm lập trình Fullstack (.NET-ReactJS) từ 4 năm trở lên; \n- Thành thạo .NET MVC, .Net Core, SQL Server, Postgresql Server, Javascript/Jquery, HTML/CSS; \n- Có khả năng phân tích thiết kế hệ thống và kiến thức về Design Pattern, OOP...; \n- Có kinh nghiệm làm việc với MongoDB, Redis Cache, Rabbit MQ, SignalR; \n- Có kiến thức về bảo mật và hiểu biết về Google Adwords API, Cache.",
    "Benefits": "- Mức lương: Thỏa thuận theo năng lực, lên tới 45.000.000 VNĐ/ tháng; \n- Hưởng đầy đủ các chế độ bảo hiểm theo luật của nhà nước; \n- Chế độ nghỉ phép, nghỉ Lễ, Tết theo quy định của Nhà nước; các ngày nghỉ khác theo quy định riêng của Công ty (ngày thành lập Công ty, nghỉ mát...) \n- Được đào tạo trực tiếp trong quá trình thực hiện Dự án, theo lộ trình phát triển riêng cho từng cá nhân, phù hợp với năng lực;",
    "Address": "- Hà Nội: Số 139 đường Ngọc Hồi, phường Hoàng Liệt, quận Hoàng Mai, Hoàng Mai",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "Công ty TNHH VKX",
    "ApplicationDeadline": "29/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/ky-su-lap-trinh-phan-mem-software-engineering-net-yeu-cau-2-nam-kinh-nghiem-thu-nhap-len-toi-25-trieu-thang-lam-viec-tai-ha-noi/1518774.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "- Tham gia nghiên cứu/phát triển/nâng cấp các sản phẩm/giải pháp chuyển đổi số của công ty, ... \n- Nghiên cứu và áp dụng các công nghệ mới vào dự án \n- Các công việc khác theo sự phân công của Quản lý dự án.",
    "JobId": "acf83bb4-d0d4-4356-a543-72ac4a8c7efa",
    "Requirements": "- Tốt nghiệp chuyên ngành công nghệ thông tin, kỹ thuật phần mềm, ....\n- Tối thiểu 2 năm kinh nghiệm phát triển trên nền tảng .NET Framework/.NET Core;\n- Thành thạo ASP.NET, MVC, Web API, Entity Framework;\n- Sử dụng thành thạo HTML, Javascript.",
    "Benefits": "- Mức lương: Thỏa thuận theo năng lực, lên tới 25.000.000 VNĐ/ tháng;\n- Hưởng đầy đủ các chế độ bảo hiểm theo luật của nhà nước;\n- Chế độ nghỉ phép, nghỉ Lễ, Tết theo quy định của Nhà nước; các ngày nghỉ khác theo quy định riêng của Công ty (ngày thành lập Công ty, nghỉ mát...);\n- Được đào tạo trực tiếp trong quá trình thực hiện Dự án, theo lộ trình phát triển riêng cho từng cá nhân, phù hợp với năng lực.",
    "Address": "- Hà Nội: Số 139 đường Ngọc Hồi, phường Hoàng Liệt, quận Hoàng Mai, Hoàng Mai",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY TRÁCH NHIỆM HỮU HẠN GIẢI PHÁP CÔNG NGHỆ CỘNG",
    "ApplicationDeadline": "23/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/senior-net-developer-3-8-years-experience/1514505.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Tham gia nghiên cứu, thiết kế, xây dựng, phát triển và triển khai hệ thống Công nghệ Thông tin cho Tài chính, Ngân hàng.\nTham gia xây dựng ý tưởng, tham gia thiết kế sản phẩm, giải pháp.\nXây dựng tài liệu kỹ thuật sản phẩm, dự án.\nTham gia xây dựng tài liệu đào tạo, tham gia đào tạo và hỗ trợ người sử dụng.\nBảo trì, nâng cấp hệ thống cho sản phẩm, dự án.\nHợp tác với các bộ phận khác trong quá trình thực hiện dự án.\nTham gia cải tiến quy trình phát triển sản phẩm, dự án.\nCác công việc phát sinh khác theo yêu cầu kỹ thuật dự án.\nBáo cáo kết quả công việc, thời gian làm việc phù hợp với quy định Công ty",
    "JobId": "18fd889b-9f8c-46ba-b0bd-86e4ad4711ed",
    "Requirements": "Chuyên ngành đào tạo: Tốt nghiệp Đại học chuyên ngành CNTT hoặc tương đương.\nKinh nghiệm làm việc: \nTừ 3 năm đến 8 năm kinh nghiệm xây dựng và phát triển dự án trong lĩnh vực CNTT. \nĐã tham gia xây dựng, phát triển, triển khai các giải pháp liên quan trong lĩnh vực CNTT cho ngành Tài chính, Ngân hàng là một lợi thế.\nKiến thức chuyên môn và kỹ thuật:\nKinh nghiệm thiết kế hệ thống, thiết kế cơ sở dữ liệu, Design Pattern.\nKinh nghiệm lập trình ứng dụng với .Net Framework, Java và các ngôn ngữ lập trình phổ dụng khác.\nKinh nghiệm làm việc với một trong các hệ thống CSDL như: Oracle, MS SQL Server, MySQL, PostgreSQL ...\nKinh nghiệm xây dựng các ứng dụng trên nền tảng Cloud Native / kiến trúc Microservice.\nKinh nghiệm triển khai các ứng dụng trên Docker container cho môi trường Windows & Linux\nKinh nghiệm và hiểu biết về các yêu cầu bảo mật trên môi trường Cloud.\nQuen thuộc với Continuous Integration / Continuous Deployment.\nTiếng Anh giao tiếp, đọc hiểu tốt. \nKhả năng làm việc độc lập và chịu áp lực trong môi trường nhịp độ cao.\nKỹ năng phân tích, phản biện, tư duy logic và giải quyết vấn đề tốt.",
    "Benefits": "Thu nhập: cạnh tranh với thị trường ở vị trí công việc.\nĐược cung cấp thiết bị phục vụ công việc theo chính sách của Công ty.\nĐóng BHXH đầy đủ theo quy định nhà nước và Tham gia gói Bảo hiểm sức khỏe hàng năm theo chính sách công ty.\nThưởng các ngày lễ tết: Theo quy định chung của Công ty.\nChế độ tăng lương hấp dẫn: thù lao và thưởng cho nhân viên dựa trên hiệu suất làm việc và đóng góp cá nhân. Được xem xét ngay khi bạn là một nhân viên xuất sắc mà không cần chờ tới kỳ đánh giá định kỳ.\nMôi trường làm việc trẻ trung, năng động, với cơ hội phát triển và thăng tiến cao.\nNghỉ phép: 12 ngày/ năm và phép thâm niên.\nChế độ du lịch: 1 năm /1 lần, chương trình Teambuilding được tổ chức thường niên.\nThời gian làm việc: Sáng: 8h30 - 12h00, Chiều: 13h30 - 18h00 (từ thứ 2 - sáng thứ 7).\nCác chế độ khác: theo Luật Lao động Việt Nam – theo Nội quy lao động và Quy định tài chính của Công ty.",
    "Address": "- Hà Nội: 74 Khúc Thừa Dụ, Dịch Vọng, Cầu Giấy",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:30 đến 18:00)\nThứ 7 (từ 08:00 đến 12:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "TẬP ĐOÀN CÔNG NGHIỆP - VIỄN THÔNG QUÂN ĐỘI",
    "ApplicationDeadline": "22/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/java-engineer-java-developer-java-fullstack-developer-java-se-java-ee/1512336.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "• Tiếp nhận yêu cầu bài toán từ khách hàng, viết tài liệu phân tích yêu cầu, đặc tả yêu cầu, thiết kế chi tiết, thiết kế CSDL\n• Lập trình các chức năng được giao theo tài liệu giải pháp chi tiết.\n• Thực hiện các nhiệm vụ sửa lỗi được phát hiện trong quá trình phát triển và triển khai.\n• Viết và thực hiện unit test.\n• Thực hiện upcode các yêu cầu nâng cấp của dự án.\n• Thiết kế được các module thành phần, các chức năng chi tiết theo kiến trúc đã có sẵn.\n• Tích hợp mã nguồn (merge code), tích hợp hệ thống.\n• Viết tài liệu Hướng dẫn cài đặt, vận hành, khai thác.\n• Cài đặt, triển khai hệ thống\n• Tối ưu hệ thống",
    "JobId": "9489a256-6524-447b-b10b-74276f480873",
    "Requirements": "· Tốt nghiệp Đại học bằng khá trở lên chuyên ngành CNTT, ĐTVT, Toán tin Ứng dụng\n· Ít nhất 1 năm kinh nghiệm phát triển ứng dụng phần mềm bằng ngôn ngữ Java\n· Có kiến thức tốt về lập trình và thiết kế hướng đối tượng (OOP), Design Patterns\n· Có nền tảng cấu trúc dữ liệu và giải thuật tốt\n· Có kiến thức tốt về quy trình phát triển phần mềm\n· Thành thạo một trong các công nghệ: Webservices (SOAP/RESTful), Websocket, Hibernate, JPA, HTML5/CSS3, Spring MVC, Struts\n· Thành thạo một trong các hệ quản trị CSDL quan hệ: Oralce, MySQL, SQL Server\n· Có kỹ năng làm việc độc lập và làm việc theo nhóm tốt\n· Có kỹ năng giải quyết vấn đề tốt\n· Khả năng chịu áp lực cao\n· Năng động, sáng tạo, có khả năng tự nghiên cứu\n· Ưu tiên ứng viên có chứng chỉ quốc tế của Oracle về phát triển ứng dụng Java: Java SE, Java EE\n• Toeic 550 trở lên hoặc tương đương",
    "Benefits": "● 12 ngày phép hàng năm theo Luật Lao Động và 3 ngày nghỉ mát, nghỉ ngày lễ 22/12 \n● Bảo hiểm sức khỏe và tai nạn cá nhân của MIC (Hạn mức chi trả lên đến 600 triệu/năm) \n● Review lương định kì vào tháng 3 hàng năm \n● Khám sức khỏe định kì hàng năm \n● Giải thưởng ghi nhận năng lực, các đóng góp nổi bật kịp thời: \n + Giải thưởng Nhân viên Xuất sắc tháng trị giá 02 triệu VNĐ \n + Giải thưởng Nhân viên Xuất sắc năm trị giá từ 02-10 triệu VNĐ \nĐào tạo và phát triển: \n● Hỗ trợ từ 50-100% chi phí dự thi các chứng chỉ và khen thưởng theo cấp độ chứng chỉ lên đến 05 triệu đồng : Hỗ trợ thi chứng chỉ Quốc tế \n● Giải thưởng bug bounty hàng quý, giá trị giải thưởng lên đến 70 triệu \n● Giải thưởng sáng kiến, ý tưởng (được ghi nhận) trị giá từ 01 triệu đồng đến hàng trăm triệu đồng \nMôi trường và Văn hóa: \n● Làm việc tại văn phòng Hạng A - tòa Landmark 72 với tổ hợp không gian xanh và khu vực riêng dành cho Tập Gym, giải trí (chơi Bi-a, Pes, Café, Đọc sách) \n● Thư giãn 30 phút mỗi ngày với hoạt động Happy hours (16h-16h30) \n● 02 phần quà Tết gửi tặng gia đình, người thân \n● Tham gia các event Công ty: hoạt động Teambuilding hàng quý, Sinh nhật hàng tháng, Year End Party, nghỉ mát, ngày lễ 08/03, 20/10 (các chị em được nghỉ 1⁄2 ngày), ngày sinh nhật tập đoàn 01/06, ... \n● Tổ chức sinh nhật cá nhân: Phần quà và bánh sinh nhật từ phía Công ty \n● Các hoạt động thể thao: câu lạc bộ Bóng đá, Bi-a ....",
    "Address": "- Hà Nội: Số 1 Giang Văn Minh, Ba Đình\n- Hà Nội: Tầng 42 + 43, tòa nhà Keangnam Landmark 72 Phạm Hùng, Nam Từ Liêm",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "Công ty TNHH Shinhan DS Việt Nam",
    "ApplicationDeadline": "30/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/software-developer-c-c/1505677.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Shinhan DS Vietnam is established to be in charge of the ICT synergy of Shinhan Financial Group in Southeast Asia.\nSDSer's top priority is accelerating the client's business growth by strengthening their ICT systems.\nCollaborate closely with clients and IT professionals in the analysis, development, and testing of banking features & functions (web)\nWrite efficient source code to program complete applications.\nMaintain, modify or create new applications based on requirements.\nIdentify errors, and bugs, and devise solutions to these problems.\nAttend business (banking, stock/ securities & finance), and technical training from Korea's top experts.",
    "JobId": "881e3129-1059-4c5c-820a-dfc6cc732aae",
    "Requirements": "From 3 years of experience in Software Development/Embedded Development\nProficiency in C/C++ based on Unix, and Linux.\nFamiliar with SQL/Oracle.\nGood to have: ProC and Finance & Banking field.\nGood problem-solving & communication skills.\nDetail-oriented, proactive, and fast learner.",
    "Benefits": "Our company provides an opportunity to grow as an expert Banking IT in Vietnam\nYou can learn about Banking concepts and know-how from Korea specialized developers\nIn addition, We have plans to expand our company to Indonesia, Myanmar, Philippines\nWe plan to offer training for outstanding employees in Korea. \nLet's Excite you more with our Brilliant perks:\nSalary: You will be happy + Pass-Probation Bonus\nPerformance Bonus: twice a year.\n12 days of annual leaves\nPersonal Allowances for birthdays, marriage, new babies, etc.\nTeam monthly allowance.\nSpecial loan offers and fee waivers from Shinhan Bank.\nCompany Trips, annual/monthly/weekly activities and events.\nHealth check once a year and premium healthcare program. \nEducation Programs and overseas training opportunities.",
    "Address": "- Hồ Chí Minh: The Mett, Thủ Đức",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY TNHH CÔNG NGHỆ TAPBI VIỆT NAM",
    "ApplicationDeadline": "01/12/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/ios-developer-thu-nhap-15-30-trieu-tai-ha-noi/1523799.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Tham gia phát triển và xây dựng các ứng dụng IOS \nTham gia vào quy trình sáng tạo và phát triển ứng dụng mới của công ty. \nThực hiện đánh giá mã và cung cấp phản hồi kịp thời và mang tính xây dựng. \nPhát triển các sản phẩm giải trí, tiện ích, video và hình ảnh",
    "JobId": "e098e90a-a0cb-4781-a9d7-5a3ace177a69",
    "Requirements": "Trên 1 năm kinh nghiệm làm việc trong lĩnh vực phát triển ứng dụng di động. (Ưu tiên đã làm có sản phẩm IOS) \nCó kiến thức về cấu trúc dữ liệu, giải thuật, lập trình hướng đối tượng. \nCó kiến ​​thức về các nguyên tắc thiết kế và hướng dẫn giao diện ứng dụng của Apple \n Có kinh nghiệm sử dụng các nền tảng /công cụ phân phối, ví dụ: Fastlane, Firebase, Testflight \nCó khả năng nghiên cứu và hiểu tài liệu kỹ thuật bằng tiếng Anh. \nThái độ học tập tốt, tính chuyên nghiệp và tinh thần trách nhiệm cao \nCó khả năng làm việc teamwork cũng như làm việc độc lập. \nChủ động, trách nhiệm cao với công việc, khả năng cống hiến và gắn bó lâu dài với Công ty. \nCó sản phẩm demo là lợi thế",
    "Benefits": "Mức lương: 15 triệu - 30 triệu \nReview lương: 1-2 lần/năm. \nThử việc nhận 100% lương. \nPV 1 vòng \nNgày phép: 12 ngày/năm; nghỉ lễ theo lịch nhà nước và công ty. \nDu lịch hàng năm, Teambuilding theo quý, cuối năm do công ty tổ chức. \nSinh nhật Công ty, 20/10, 8/3, Gala cuối năm... \nLương tháng 13 \nTrà, coffee, đồ ăn ngọt miễn phí \nThưởng theo lợi nhuận - thưởng nóng theo dự án. \nCung cấp thiết bị làm việc \nMôi trường làm việc: \nMôi trường làm việc chuyên nghiệp, trẻ trung, năng động. \nKhông gian làm việc đẹp, kích thích sự sáng tạo.",
    "Address": "- Hà Nội: CIC tower số 1 Nguyễn Thị Duệ, Yên Hòa, Cầu Giấy",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:30 đến 18:00)\nNghỉ trưa 1,5h",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY CỔ PHẦN CÔNG NGHỆ EC",
    "ApplicationDeadline": "22/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/chuyen-vien-phat-trien-ung-dung-lap-trinh-vien-developer-dev/1511066.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "-\tPhát triển, bảo trì các chức năng, sản phẩm dịch vụ, các báo cáo tác nghiệp và quản lý liên quan đến hệ thống Core banking, hệ thống tích hợp với đối tác bên ngoài được phân công. \n-\tLập trình ứng dụng mobile, java, .net, docker, K8S, database; Lập trình AI ngôn ngữ python trên các hệ thống: \n-\tHê thống quản lý quy trình kinh doanh (BPM). \n-\tNgân hàng số (Edigi/Ebiz). \n-\tLập trình RPA, OCR. \n-\tTối ưu hóa hệ thống ứng dụng theo yêu cầu. \n-\tTổ chức quản lý và triển khai các dự án và dịch vụ thuê ngoài mảng CNTT được phân công. \n-\tThực hiện các công việc khác theo sự phân công của quản lý trực tiếp/ lãnh đạo đơn vị.",
    "JobId": "a3964c82-2f33-4292-a3ab-fc0762f918d6",
    "Requirements": "-\tĐộ tuổi: 25 – 35 \n-\tGiới tính: Nam/Nữ \n-\tTốt nghiệp đại học trở lên các chuyên ngành liên quan CNTT. \n-\tTối thiểu 03 năm trong lĩnh vực lập trình ứng dụng CNTT. \n-\tCó kiến thức về lập trình, hiểu biết chuyên sâu về cơ sở dữ liệu đặc biệt là Oracle, kỹ năng viết tốt SQL/PLSQL, ngôn ngữ lập trình C, C#, Java, Python, hiểu biết về các framework ngân hàng đang sử dụng. \n-\tHiểu biết tốt về nghiệp vụ ngân hàng liên quan đến phân hệ phụ trách. \n-\tKhả năng lập trình, phân tích, thiết kế hệ thống đối với việc phát triển sản phẩm mới trên hệ thống mình phụ trách. \n-\tKinh nghiệm ưu tiên: có kinh nghiệm về triển khai các Dự án CNTT \n-\tCó khả năng giao tiếp (nói, viết) bằng tiếng Anh ở cấp độ tương đối thành thạo và đọc hiểu được các tài liệu chuyên môn có liên quan (tương đương IELTS 5.0, TOEIC 450, ...) hoặc có chứng chỉ nghề nghiệp chuyên sâu có liên quan công việc, được sử dụng phổ biến trên thị trường/ được quốc tế công nhận.",
    "Benefits": "-\tMức lương: Mức lương cạnh tranh theo năng lực \n-\tThời gian làm việc: \n-\tKhối Back office: 8h30-17h30 từ Thứ 2 đến Thứ 6, nghỉ Thứ 7, Chủ nhật, lễ Tết. \n-\tKhối kinh doanh: linh hoạt theo tính chất công việc \n-\tLàm việc trong môi trường năng động, chuyên nghiệp với nhiều dự án triển khai, có nhiều cơ hội thăng tiến. \n-\tHưởng đầy đủ quyền lợi theo Luật Lao động \n-\tKhám sức khỏe định kì cho CBNV hàng năm. \n-\tThưởng Lễ Tết: Tháng lương 13 + Thưởng Theo kết quả kinh doanh của Công ty.",
    "Address": "- Hà Nội: Tầng 4, 37 Bà Triệu, Hàng Bài, Hoàn Kiếm",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "Công Ty TNHH LG CNS VIỆT NAM",
    "ApplicationDeadline": "30/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/back-end-developer-java-mysql-spring-tai-ha-noi-thu-nhap-hap-dan/1476042.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "LG CNS đang tìm kiếm các lập trình viên Back-End đủ tiêu chuẩn tham gia vào các dự án phát triển của công ty. Bạn sẽ phát triển trong việc phát triển ứng dụng web trong các lĩnh vực khác nhau, chẳng hạn như: AI Machine learning / Data , Security & Solution, DX... \nĐảm bảo hiệu suất, chất lượng và khả năng đáp ứng tốt nhất có thể của các ứng dụng ở phía Back-end \nTư vấn, phân tích, thiết kế \nPhát triển, kiểm thử, sửa lỗi \nVận hành và bảo trì hệ thống.",
    "JobId": "e758abac-f448-4790-9c31-c54abe475452",
    "Requirements": "Có ít nhất 3 năm kinh nghiệm về JAVA \nCó kinh nghiệm phát triển ứng dụng web\nPhát triển dựa trên Spring, Spring Boot F/W\nPhát triển API (REST API)\nSử dụng thành thạo 1 trong các ngôn ngữ DB như MySQL, MongoDB , Oracle , SQL\nGit, Jira, Confluence\nHiểu và áp dụng CI/CD\nTốt nghiệp Đại Học trở lên\nGiao tiếp Tiếng anh ở mức trung bình \nƯU TIÊN\nCó kinh nghiệm làm việc trong môi trường Kubernetes, Cloud (AWS, GCP) sử dụng Python\nCó kinh nghiệm về tối ưu hóa SQL\nGiao tiếp tiếng Hàn\nCó khả năng xử lý lỗi vào ban đêm (Làm remote tại nhà).",
    "Benefits": "Lương, thưởng sẽ được thảo luận sau khi thông qua CV & Phỏng vấn \nReview đánh giá năng lực hàng năm và điều chỉnh tăng lương theo hiệu quả công việc \nPhụ cấp chứng chỉ ngoại ngữ tiếng hàn (TOPIK) \nChăm sóc sức khỏe: Khám sức khỏe định kỳ hàng năm, Bảo hiểm sức khỏe cao cấp. \nĐiều kiện làm việc thoải, linh hoạt \nCơ hội phát triển nghề nghiệp tốt với các dự án thú vị và đầy thử thách \nCác khóa đào tạo tiếng Anh, tiếng Hàn, kỹ thuật, kỹ năng mềm \nCơ hội học các khóa học đặc biệt của LG CNS, công nghệ mới và bảo mật \nQuà tặng vào các dịp lễ, tết (30/4-1/5, 2/9, tết v.v) \nCác hoạt động ngoài trời với sự hỗ trợ của công ty: câu lạc bộ thể thao, team building, tiệc happy hour, sinh nhật, du lịch, sự kiện nhân viên và gia đình, v.v. \nThời gian làm việc: 8 tiếng từ T2 - T6 (8:00- 12:00/ 13:00- 17:00), Happy hour chiều thứ 6 hàng tuần.",
    "Address": "- Hà Nội: Tầng 15, Keangnam Landmark 72, Nam Từ Liêm",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "Công ty cổ phần Công nghệ thông tin Phú Minh (Phú Minh Teck)",
    "ApplicationDeadline": "30/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/java-dev-3-years-signing-bonus-hap-dan-rat-on-dinh-lau-dai/1460545.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Tham gia phát triển dự án phần mềm\nCác dự án thuộc domain: ngân hàng, tài chính, thị trường Nhật, thị trường nói tiếng Anh, ...\nThực hiện thiết kế, coding và unit test cho dự án.\nTham gia việc review code, hỗ trợ các thành viên trong nhóm.\nThực hiện công việc theo sự phân công của Trưởng nhóm/Quản lý dự án, phối hợp giữa các nhóm để phát triển dự án.",
    "JobId": "75b04609-cfe0-4866-ab6f-b5816a34cca5",
    "Requirements": "Có kinh nghiệm làm việc với Java tối thiểu 3 năm.\nThành thạo trong việc sử dụng các framework web Java như Spring MVC, Spring Boot hoặc Hibernate.\nHiểu biết cơ bản 1 trong các FE framework (Vue, React, Angular..) để phát triển giao diện người dùng tương tác\nHiểu biết về thiết kế ứng dụng, công nghệ microservice.\nCó kiến thức vững về HTML, CSS và JavaScript.\nCó kinh nghiệm làm việc với hệ thống message queue (ActiveMQ, Kafka..) để xử lý các thư hàng đợi.\nCó kinh nghiệm làm việc với hệ quản trị cơ sở dữ liệu quan hệ RDBMS(SQL server, PostgreSQL) và NoSQL(Cassandra, mongodb..)\nCó kiến thức và kinh nghiệm với Linux.\nCó khả năng làm việc độc lập và làm việc nhóm tốt.",
    "Benefits": "Chế độ phúc lợi toàn diện\nLương: UPTO 40.000.000 VNĐ/tháng\nTối thiểu 13 tháng lương/năm.\nThử việc nhận 100% lương\nXét tăng lương 1- 2 lần/năm.\nThưởng: Thưởng Tết, thưởng ngày lễ, thưởng giới thiệu nhân sự...\nVăn phòng làm việc chuyên nghiệp hạng A.\nMôi trường làm việc thân thiện và có tính tương hỗ cao, ổn định lâu dài.\nCó nhiều cơ hội được đào tạo, làm việc nâng cao trình độ và cơ hội thăng tiến.\nCó nhiều hoạt động bổ trợ tinh thần, du lịch...\nCó cơ hội làm việc tại nước ngoài.",
    "Address": "- Hà Nội: Cầu Giấy",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY CỔ PHẦN THƯƠNG MẠI VÀ DỊCH VỤ CÔNG NGHỆ GTSC VIỆT NAM",
    "ApplicationDeadline": "30/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/lap-trinh-vien-backend-developer-be/1521202.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "-\t Tối ưu hóa hiệu suất xử lý sản phẩm, dịch vụ hiện đang có, để cải tiến sản phẩm, dịch vụ \n-\t Phát triển mới các ứng dụng, sản phẩm, dịch vụ. \n-\t Kiểm tra mã, khắc phục các lỗi trong lập trình; \n-\t Làm việc nhóm tạo ra các ứng dụng, phần mềm lớn hơn, phối hợp với SA, BA, Tester trong quá trình làm việc \n-\t Thu thập các phản hồi để cải tiến sản phẩm",
    "JobId": "eca295cd-54d0-4929-bb43-b780c52831d0",
    "Requirements": "- Tốt nghiệp đại học chuyên ngành Công nghệ thông tin \n-\tCó kinh nghiệm từ 03 năm trở lên. \n-\tCó tinh thần trách nhiệm cao trong công việc. \n-\tCó tinh thần học hỏi, năng động, làm việc nhóm hoặc độc lập. \n-\tCó kỹ năng tư duy logic, tư duy thuật toán tốt, có kỹ năng phân tích, giải quyết vấn đề \n-\tCó từ 03 năm kinh nghiệm vị trí dev. \n-\tCó kinh nghiệm làm việc trong các dự án product và mô hình Agile Scrum. \n-\tSử dụng thành thạo nền tảng .NET để lập trình các giải pháp phần mềm, ứng dụng \n-\tThành thạo lập trình ASP.NET, NET CORE 6/7/8 , C#, ABP framework C# \n - Nắm chắc kiến thức về RESTful service/Web API \n - Có kinh nghiệm về database (NoSQL, SQL), redis, kafka \nGiới tính, độ tuổi.\tKhông giới hạn",
    "Benefits": "- Lương lên thỏa thuận theo năng lực có thể lên đến hơn 30 triệu \n-\t Thưởng lương tháng 13, thưởng lễ tết theo quy định và kết quả kinh doanh của Công ty. \n- Làm việc Từ thứ hai đến thứ 6\nSáng : từ 08h00 đến 12h00 \nChiều : Từ 13h00 đến 17h00 \n-\tNghỉ các ngày Lễ, Tết theo quy định của pháp luật \n-\tBHXH,BHYT,BHTN theo quy định của pháp luật \n-\tBảo hiểm tai nạn và sức khỏe PTI \n-\tDu lịch/ Teambuilding 01 lần/năm",
    "Address": "- Hà Nội: 103-105 Nguyễn Tuân, Thanh Xuân",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  },
  {
    "Name": "CÔNG TY TNHH ISB VIỆT NAM",
    "ApplicationDeadline": "30/11/2024",
    "LinkCompany": "https://www.topcv.vn/viec-lam/intern-frontend-dev-japanese-at-least-n4-tai-ho-chi-minh-thu-nhap-6-9-trieu-gross/1496246.html?ta_source=JobSearchList_LinkDetail&u_sr_id=Szls65CkZkgRpYppK3m7LtwVuKQEv2cUdIyD1ljw_1730848215",
    "Description": "Collaborate with senior developers to design and develop user-friendly web interfaces. \nWrite clean, efficient, and well-structured code adhering to best practices and coding standards. \nUtilize JavaScript, jQuery, HTML, and CSS to create visually appealing and responsive web applications. \nIntegrate with RESTful APIs to fetch and manipulate data. \nConduct thorough debugging and utilize browser developer tools effectively. \nLearn and adapt to new technologies and frameworks as needed. \nParticipate in code reviews and provide constructive feedback.",
    "JobId": "5925126c-b29a-4e71-ab1e-d9d8fef8b99e",
    "Requirements": "Final year student or recent graduate majoring in Information Technology.\nFull-time internship and work full time after internship.\nStrong understanding of Object-Oriented Programming (OOP) principles.\nExperience in JavaScript, jQuery, HTML, and CSS.\nUnderstanding of RESTful API concepts and integration.\nStrong debugging and problem-solving skills.\nKnowledge of version control systems (Git, SVN).\nAbility to learn and adapt to new technologies quickly.\nGood communication and interpersonal skills.\nA passion for learning and growing as a developer.\nJapanese (N4 level or higher)",
    "Benefits": "Attractive Intern salary.\nMotorbike or bus support allowance.\nHave a chance to be official member of ISB Vietnam.\nProfessional and challenge working environment.\nJapanese culture and working atmosphere discovery.",
    "Address": "- Hồ Chí Minh: E Town 2, 364 Cộng Hòa Phường 13, Tân Bình",
    "WorkingHours": "Thứ 2 - Thứ 6 (từ 08:00 đến 17:00)",
    "HowToApply": "Ứng viên nộp hồ sơ trực tuyến bằng cách bấm Ứng tuyển ngay dưới đây."
  }
]
